import matplotlib.pyplot as plt

# 横坐标
x = ['0.01', '0.02', '0.03', '0.04', '0.05', '0.06', '0.07', '0.08', '0.09']

# 四条纵坐标数据
y1 = [0.60168993261,0.61013415811, 0.638420029156062,0.641321515, 0.64495494810159,0.638512873421, 0.63521549358392,0.633124151, 0.629199326081974]
y2 = [0.493125534264642,0.52561219412751, 0.548314546775435,0.5641212115151, 0.58495494810159,0.579582189518, 0.5754365422133,0.564217125819, 0.5539219575842]
y3 = [0.52854953415043,0.556281501, 0.581314808000469,0.589217519211, 0.601405503196299,0.601317251, 0.594871322619078,0.5912157128, 0.585093634252533]
y4 = [0.4993288156,0.4951512161321, 0.504896611431867,0.50749511, 0.518460902334746,0.52014915321, 0.509668180811471,0.50831275121, 0.509668180811471]

# 绘制折线图
plt.plot(x, y1, label='V1', marker='o', color='black')  
plt.plot(x, y2, label='V2', marker='s', color='darkred')   
plt.plot(x, y3, label='V3', marker='^', color='darkgreen') 
plt.plot(x, y4, label='V4', marker='D', color='darkorange')   

# 添加标题和标签

plt.xlabel('$\epsilon$ & $\delta$', fontsize=24)
plt.ylabel('APFD', fontsize=24)

plt.tick_params(axis='both', which='major', labelsize=18)

# 显示图例


# 显示图表
plt.xticks(rotation=45)  # 旋转x轴标签，避免重叠
plt.grid(True, alpha=0.2)  # 添加网格线
plt.tight_layout()  # 自动调整布局以防止标签被遮挡

plt.show()
