import matplotlib.pyplot as plt

# 横坐标
x = ['0.01', '0.02', '0.03', '0.04', '0.05', '0.06', '0.07', '0.08', '0.09']

# 四条纵坐标数据
y1 = [0.468012899936,0.5321521421, 0.593006654635,0.603129051, 0.6120616429735,0.610213912511, 0.60831320772986,0.6032137215912, 0.6001293958311]
y2 = [0.48921853121,0.494219412751, 0.504219129572,0.5232115151, 0.55484211098841,0.5512382189518, 0.555442431122,0.548737125819, 0.54585872011052]
y3 = [0.652064393939394,0.6741281501, 0.719863437001594,0.723217519211, 0.740661881977671,0.73831278417251, 0.734965111642743,0.73132157128, 0.730871212121212]
y4 = [0.511306580408819,0.543215161321, 0.561389254865923,0.5832180129511, 0.604580947978057,0.5983281581321, 0.59426653912009,0.589381205129421, 0.585674572270418]

# 绘制折线图
plt.plot(x, y1, label='V1', marker='o', color='black')  
plt.plot(x, y2, label='V2', marker='s', color='darkred')   
plt.plot(x, y3, label='V3', marker='^', color='darkgreen') 
plt.plot(x, y4, label='V4', marker='D', color='darkorange')   

# 添加标题和标签

plt.xlabel('$\epsilon$ & $\delta$', fontsize=24)
plt.ylabel('APFD', fontsize=24)

plt.tick_params(axis='both', which='major', labelsize=18)

# 显示图例


# 显示图表
plt.xticks(rotation=45)  # 旋转x轴标签，避免重叠
plt.grid(True, alpha=0.2)  # 添加网格线
plt.tight_layout()  # 自动调整布局以防止标签被遮挡

plt.show()
